Hyooki/STM32DUINO_GAMEPAD/cores/arduino/libstm32f1/analog.c
  if (HAL_ADC_Start(&AdcHandle) != HAL_OK)
  {
    /* Start Conversation Error */
    return 0;
  }

  /*##-4- Wait for the end of conversion #####################################*/
  /*  For simplicity reasons, this example is just waiting till the end of the
      conversion, but application may perform other tasks while conversion
      operation is ongoing. */
  if (HAL_ADC_PollForConversion(&AdcHandle, 10) != HAL_OK)
  {
    /* End Of Conversion flag not set on time */
    return 0;
  }

  /* Check if the continous conversion of regular channel is finished */
  if ((HAL_ADC_GetState(&AdcHandle) & HAL_ADC_STATE_REG_EOC) == HAL_ADC_STATE_REG_EOC)
  {
    /*##-5- Get the converted value of regular channel  ########################*/
    uhADCxConvertedValue = HAL_ADC_GetValue(&AdcHandle);
  }

  if (HAL_ADC_Stop(&AdcHandle) != HAL_OK)
  {
    /* Start Conversation Error */
    return 0;
  }

  return uhADCxConvertedValue;
}

////////////////////////// PWM INTERFACE FUNCTIONS /////////////////////////////


/**
  * @brief TIM MSP Initialization
  *        This function configures the hardware resources used in this example:
  *           - Peripheral's clock enable
  *           - Peripheral's GPIO Configuration
  * @param htim: TIM handle pointer
  * @retval None
  */
void HAL_TIM_PWM_MspInit(TIM_HandleTypeDef *htim)
{
  /* TIMx Peripheral clock enable */
  timer_enable_clock(htim);

  g_analog_init_config[g_current_init_id].alFunction();
  
  digital_io_init(g_analog_init_config[g_current_init_id].port, g_analog_init_config[g_current_init_id].pin, GPIO_MODE_AF_PP, GPIO_NOPULL);
}

/**
  * @brief  DeInitializes TIM PWM MSP.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PWM_MspDeInit(TIM_HandleTypeDef *htim)
{
  timer_disable_clock(htim);
}


/**
  * @brief  This function will set the PWM to the required value
  * @param  port : the gpio port to use
  * @param  pin : the gpio pin to use
  * @param  clock_freq : frequency of the tim clock
  * @param  period : period of the tim counter
  * @param  value : the value to push on the PWM output
  * @param  do_init : if set to 1 the initialization of the PWM is done
  * @retval None
  */
void pwm_start(GPIO_TypeDef  *port, uint32_t pin, uint32_t clock_freq,
                uint32_t period, uint32_t value, uint8_t do_init)
{

  //find the instance in the global
  int8_t id = get_analog_instance(port, pin);
  if(id < 0) return;
  
  TIM_HandleTypeDef analog_timer_config;
  
  analog_timer_config.State = HAL_TIM_STATE_RESET;
  analog_timer_config.Init.ClockDivision     = 0;
  analog_timer_config.Init.CounterMode       = TIM_COUNTERMODE_UP;
  analog_timer_config.Init.RepetitionCounter = 0;	  


  /* Compute the prescaler value to have TIM counter clock equal to clock_freq Hz */
  analog_timer_config.Instance               = g_analog_init_config[id].timInstance;
  analog_timer_config.Init.Prescaler         = (uint32_t)(SystemCoreClock / clock_freq) - 1;
  analog_timer_config.Init.Period            = period;

  
  if(do_init == 1) 
  {
    g_current_init_id = id;
    if (HAL_TIM_PWM_Init(&analog_timer_config) != HAL_OK) 
	{
			  digitalWrite(13,HIGH);
      return;
    }
  }

  HAL_TIM_PWM_Stop(&analog_timer_config, g_analog_init_config[id].timChannel);

  
  /*##-2- Configure the PWM channels #########################################*/
  /* Common configuration for all channels */
  
	TIM_OC_InitTypeDef timConfig;
	
	timConfig.OCMode       = TIM_OCMODE_PWM1;
	timConfig.OCPolarity   = TIM_OCPOLARITY_HIGH;
	timConfig.OCFastMode   = TIM_OCFAST_DISABLE;
	timConfig.OCNPolarity  = TIM_OCNPOLARITY_HIGH;
	timConfig.OCNIdleState = TIM_OCNIDLESTATE_RESET;
	timConfig.OCIdleState  = TIM_OCIDLESTATE_RESET;
	timConfig.Pulse = value;
	 
	
	 
  if (HAL_TIM_PWM_ConfigChannel(&analog_timer_config, &timConfig,
                                  g_analog_init_config[id].timChannel) != HAL_OK)
  {
    /*##-2- Configure the PWM channels #########################################*/
				  digitalWrite(13,HIGH);
    return;
  }

  
  if(g_analog_init_config[id].useNchannel) {
    HAL_TIMEx_PWMN_Start(&analog_timer_config, g_analog_init_config[id].timChannel);
  } else {
    HAL_TIM_PWM_Start(&analog_timer_config, g_analog_init_config[id].timChannel);
  }

}

/**
  * @brief  This function will disable the PWM
  * @param  port : the gpio port to use
  * @param  pin : the gpio pin to use
  * @retval None
  */
void pwm_stop(GPIO_TypeDef  *port, uint32_t pin)
{

  //find the instance in the global
  int8_t id = get_analog_instance(port, pin);
  if(id < 0) return;

  TIM_HandleTypeDef analog_timer_config;
  
  analog_timer_config.Instance               = g_analog_init_config[id].timInstance;	
	
  if(g_analog_init_config[id].useNchannel) {
    HAL_TIMEx_PWMN_Stop(&analog_timer_config, g_analog_init_config[id].timChannel);
  } else {
    HAL_TIM_PWM_Stop(&analog_timer_config, g_analog_init_config[id].timChannel);
  }

  HAL_TIM_PWM_DeInit(&analog_timer_config);
	 
}


/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#ifdef __cplusplus
}
#endif

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
